In [1]:
import sqlite3
import pandas as pd

In [2]:
con = sqlite3.connect(':memory:')

In [3]:
table_names = [
    'Categories',   # –∫–∞—Ç–µ–≥–æ—Ä–∏–∏ —Ç–æ–≤–∞—Ä–æ–≤
    'Customers',    # –∑–∞–∫–∞–∑—á–∏–∫–∏
    'Employees',    # —Å–æ—Ç—Ä—É–¥–Ω–∏–∫–∏
    'OrderDetails', # –¥–µ—Ç–∞–ª–∏ –∑–∞–∫–∞–∑–æ–≤
    'Orders',       # –∑–∞–∫–∞–∑—ã
    'Products',     # —Ç–æ–≤–∞—Ä—ã
    'Shippers',     # –ø–µ—Ä–µ–≤–æ–∑—á–∏–∫–∏
    'Suppliers',    # –ø–æ—Å—Ç–∞–≤—â–∏–∫–∏
]

In [4]:
for table in table_names:
    data = pd.read_csv(f'{table}.csv', sep = ';')
    data.to_sql(table, con, index=False, if_exists='replace')

In [5]:
pd.read_sql(
    '''
    SELECT * FROM Customers
    ''',
    con,
)

,CustomerID,CustomerName,ContactName,Address,City,PostalCode,Country
0,1,Alfreds Futterkiste,Maria Anders,Obere Str. 57,Berlin,12209,Germany
1,2,Ana Trujillo Emparedados y helados,Ana Trujillo,Avda. de la Constituci√≥n 2222,M√©xico D.F.,5021,Mexico
2,3,Antonio Moreno Taquer√≠a,Antonio Moreno,Mataderos 2312,M√©xico D.F.,5023,Mexico
3,4,Around the Horn,Thomas Hardy,120 Hanover Sq.,London,WA1 1DP,UK
4,5,Berglunds snabbk√∂p,Christina Berglund,Berguvsv√§gen 8,Lule√•,S-958 22,Sweden
...,...,...,...,...,...,...,...
86,87,Wartian Herkku,Pirkko Koskitalo,Torikatu 38,Oulu,90110,Finland
87,88,Wellington Importadora,Paula Parente,"Rua do Mercado, 12",Resende,08737-363,Brazil
88,89,White Clover Markets,Karl Jablonski,305 - 14th Ave. S. Suite 3B,Seattle,98128,USA
89,90,Wilman Kala,Matti Karttunen,Keskuskatu 45,Helsinki,21240,Finland
90,91,Wolski,Zbyszek,ul. Filtrowa 68,Walla,01-012,Poland

In [6]:
tasks = 0

### –í—Å–µ –∑–∞–¥–∞–Ω–∏—è –Ω—É–∂–Ω–æ –≤—ã–ø–æ–ª–Ω–∏—Ç—å —Ç–æ–ª—å–∫–æ —Å –ø–æ–º–æ—â—å—é sql

1. –í—ã–±–µ—Ä–∏—Ç–µ –∑–∞–∫–∞–∑—á–∏–∫–æ–≤ –∏–∑ –ì–µ—Ä–º–∞–Ω–∏–∏, –§—Ä–∞–Ω—Ü–∏–∏ –∏ –ú–∞–¥—Ä–∏–¥–∞, –≤—ã–≤–µ–¥–∏—Ç–µ –∏—Ö –Ω–∞–∑–≤–∞–Ω–∏–µ, —Å—Ç—Ä–∞–Ω—É –∏ –∞–¥—Ä–µ—Å.

In [7]:
tasks+=1
pd.read_sql(
    '''
    SELECT CustomerName, Country, Address FROM Customers
    WHERE Country = 'Germany' 
    OR Country = 'France' 
    OR Country = 'Spain'
    ''',
    con,
)

,CustomerName,Country,Address
0,Alfreds Futterkiste,Germany,Obere Str. 57
1,Blauer See Delikatessen,Germany,Forsterstr. 57
2,Blondel p√®re et fils,France,"24, place Kl√©ber"
3,B√≥lido Comidas preparadas,Spain,"C/ Araquil, 67"
4,Bon app',France,"12, rue des Bouchers"
5,Drachenblut Delikatessend,Germany,Walserweg 21
6,Du monde entier,France,"67, rue des Cinquante Otages"
7,FISSA Fabrica Inter. Salchichas S.A.,Spain,"C/ Moralzarzal, 86"
8,Folies gourmandes,France,"184, chauss√©e de Tournai"
9,Frankenversand,Germany,Berliner Platz 43
10,France restauration,France,"54, rue Royale"
11,Galer√≠a del gastr√≥nomo,Spain,"Rambla de Catalu√±a, 23"
12,Godos Cocina T√≠pica,Spain,"C/ Romero, 33"
13,K√∂niglich Essen,Germany,Maubelstr. 90
14,La corne d'abondance,France,"67, avenue de l'Europe"
15,La maison d'Asie,France,1 rue Alsace-Lorraine
16,Lehmanns Marktstand,Germany,Magazinweg 7
17,Morgenstern Gesundkost,Germany,Heerstr. 22
18,Ottilies K√§seladen,Germany,Mehrheimerstr. 369
19,Paris sp√©cialit√©s,France,"265, boulevard Charonne"
20,QUICK-Stop,Germany,Taucherstra√üe 10
21,Romero y tomillo,Spain,"Gran V√≠a, 1"
22,Sp√©cialit√©s du monde,France,"25, rue Lauriston"
23,Toms Spezialit√§ten,Germany,Luisenstr. 48
24,Victuailles en stock,France,"2, rue du Commerce"
25,Vins et alcools Chevalier,France,59 rue de l'Abbaye
26,Die Wandernde Kuh,Germany,Adenauerallee 900

2. –í—ã–±–µ—Ä–∏—Ç–µ —Ç–æ–ø 3 —Å—Ç—Ä–∞–Ω—ã –ø–æ –∫–æ–ª–∏—á–µ—Å—Ç–≤—É –∑–∞–∫–∞–∑—á–∏–∫–æ–≤, –≤—ã–≤–µ–¥–∏—Ç–µ –∏—Ö –Ω–∞–∑–≤–∞–Ω–∏—è –∏ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –∑–∞–ø–∏—Å–µ–π.

In [8]:
tasks+=1
pd.read_sql(
    '''
    SELECT Country, COUNT(Country) cnt FROM Customers 
    GROUP BY Country ORDER BY cnt DESC limit(3)
    ''',
    con,
)

   Country  cnt
0      USA   13
1  Germany   11
2   France   11

3. –í—ã–±–µ—Ä–∏—Ç–µ –ø–µ—Ä–µ–≤–æ–∑—á–∏–∫–∞, –∫–æ—Ç–æ—Ä—ã–π –æ—Ç–ø—Ä–∞–≤–∏–ª 10-–π –ø–æ –≤—Ä–µ–º–µ–Ω–∏ –∑–∞–∫–∞–∑, –≤—ã–≤–µ–¥–∏—Ç–µ –µ–≥–æ –Ω–∞–∑–≤–∞–Ω–∏–µ, –∏ –¥–∞—Ç—É –æ—Ç–ø—Ä–∞–≤–ª–µ–Ω–∏—è.

In [9]:
tasks+=1
pd.read_sql(
    '''
    SELECT t.OrderDate,
    sh.ShipperName
    FROM(
    WITH tab AS (
    SELECT *,
    row_number() over() number,
    SUBSTR(OrderDate, 1, 2) days,
    SUBSTR(OrderDate, 4, 2) month,
    SUBSTR(OrderDate, 7, 4) year,
    ShipperID
    FROM Orders
    ORDER BY year, month, days)
    SELECT * FROM tab
    WHERE number = 10) t
    LEFT JOIN Shippers sh
    ON sh.ShipperID = t.ShipperID
    ''',
    con,
)

    OrderDate       ShipperName
0  16.07.1996  Federal Shipping

4. –í—ã–±–µ—Ä–∏—Ç–µ —Å–∞–º—ã–π –¥–æ—Ä–æ–≥–æ–π –∑–∞–∫–∞–∑, –≤—ã–≤–µ–¥–∏—Ç–µ —Å–ø–∏—Å–æ–∫ —Ç–æ–≤–∞—Ä–æ–≤ —Å –∏—Ö —Ü–µ–Ω–∞–º–∏.

In [10]:
tasks+=1
pd.read_sql(
    '''
    SELECT OrderDetails.*, 
    Products.Price, 
    Products.ProductName
    FROM OrderDetails
    LEFT JOIN Products
    ON OrderDetails.ProductID = Products.ProductID
    WHERE OrderID = 
        (SELECT OrderID FROM
    (SELECT OrderID, SUM(multi) totalprice FROM 
    (SELECT *,
    Quantity*Price multi
    FROM (SELECT OrderDetails.*, 
    Products.Price
    FROM OrderDetails
    LEFT JOIN Products
    ON OrderDetails.ProductID = Products.ProductID) t) tt
    GROUP BY OrderID 
    ORDER BY totalprice DESC LIMIT(1)))
    ''',
    con,
)

   OrderDetailID  OrderID  ProductID  Quantity  Price             ProductName
0            331    10372         20        12   81.0  Sir Rodney's Marmalade
1            332    10372         38        40  263.5           C√¥te de Blaye
2            333    10372         60        70   34.0       Camembert Pierrot
3            334    10372         72        42   34.8  Mozzarella di Giovanni

5. –ö–∞–∫–æ–π —Ç–æ–≤–∞—Ä –±–æ–ª—å—à–µ –≤—Å–µ–≥–æ –∑–∞–∫–∞–∑—ã–≤–∞–ª–∏ –ø–æ –∫–æ–ª–∏—á–µ—Å—Ç–≤—É –µ–¥–∏–Ω–∏—Ü —Ç–æ–≤–∞—Ä–∞, –≤—ã–≤–µ–¥–∏—Ç–µ –µ–≥–æ –Ω–∞–∑–≤–∞–Ω–∏–µ –∏ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –µ–¥–∏–Ω–∏—Ü –≤ –∫–∞–∂–¥–æ–º –∏–∑ –∑–∞–∫–∞–∑–æ–≤.

In [11]:
tasks+=1
pd.read_sql(
    '''
    SELECT SUM(Quantity) AS MAXQ, OrderID,
    Products.ProductName
    FROM OrderDetails
    LEFT JOIN Products
    ON OrderDetails.ProductID = Products.ProductID
    GROUP BY Products.ProductID
    ORDER BY MAXQ DESC LIMIT(1)
    ''',
    con,
)

   MAXQ  OrderID        ProductName
0   458    10253  Gorgonzola Telino

6. –í—ã–≤–µ–¥–∏—Ç–µ —Ç–æ–ø 5 –ø–æ—Å—Ç–∞–≤—â–∏–∫–æ–≤ –ø–æ –∫–æ–ª–∏—á–µ—Å—Ç–≤—É –∑–∞–∫–∞–∑–æ–≤, –≤—ã–≤–µ–¥–∏—Ç–µ –∏—Ö –Ω–∞–∑–≤–∞–Ω–∏—è, —Å—Ç—Ä–∞–Ω—É, –∫–æ–Ω—Ç–∞–∫—Ç–Ω–æ–µ –ª–∏—Ü–æ –∏ —Ç–µ–ª–µ—Ñ–æ–Ω.

In [12]:
tasks+=1
pd.read_sql(
    '''
    SELECT COUNT(OrderID) AS NUMBER, Suppliers.SupplierName, Suppliers.Country, 
    Suppliers.ContactName, Suppliers.Phone
    FROM OrderDetails
    LEFT JOIN Products
    ON OrderDetails.ProductID = Products.ProductID
    LEFT JOIN Suppliers
    ON Products.SupplierID = Suppliers.SupplierID
    GROUP BY Suppliers.SupplierName
    ORDER BY NUMBER DESC LIMIT(5)   
    ''',
    con,
)

,NUMBER,SupplierName,Country,ContactName,Phone
0,42,Plutzer Lebensmittelgro√üm√§rkte AG,Germany,Martin Bein,(069) 992755
1,40,"Pavlova, Ltd.",Australia,Ian Devling,(03) 444-2343
2,33,"Specialty Biscuits, Ltd.",UK,Peter Wilson,(161) 555-4448
3,32,Norske Meierier,Norway,Beate Vileid,(0)2-953010
4,31,Formaggi Fortini s.r.l.,Italy,Elio Rossi,(0544) 60323

7. –ö–∞–∫—É—é –∫–∞—Ç–µ–≥–æ—Ä–∏—é —Ç–æ–≤–∞—Ä–æ–≤ –∑–∞–∫–∞–∑—ã–≤–∞–ª–∏ –±–æ–ª—å—à–µ –≤—Å–µ–≥–æ –ø–æ —Å—Ç–æ–∏–º–æ—Å—Ç–∏ –≤ –ë—Ä–∞–∑–∏–ª–∏–∏, –≤—ã–≤–µ–¥–∏—Ç–µ —Å—Ç—Ä–∞–Ω—É, –Ω–∞–∑–≤–∞–Ω–∏–µ –∫–∞—Ç–µ–≥–æ—Ä–∏–∏ –∏ —Å—É–º–º—É.

In [13]:
tasks+=1
pd.read_sql(
    '''
    SELECT Country, SUM(OrderDetails.Quantity*Products.Price) AS Cost, Categories.CategoryName
    FROM Customers
    LEFT JOIN Orders
    ON Orders.CustomerID = Customers.CustomerID
    LEFT JOIN OrderDetails
    ON OrderDetails.OrderID = Orders.OrderID
    LEFT JOIN Products
    ON Products.ProductID = OrderDetails.ProductID
    LEFT JOIN Categories
    ON Categories.CategoryID = Products.CategoryID
    WHERE Country = 'Brazil'
    GROUP BY Products.CategoryID
    ORDER BY Cost DESC LIMIT(1)
    ''',
    con,
)

  Country     Cost CategoryName
0  Brazil  13690.0    Beverages

8. –ö–∞–∫–∞—è —Ä–∞–∑–Ω–∏—Ü–∞ –≤ —Å—Ç–æ–∏–º–æ—Å—Ç–∏ –º–µ–∂–¥—É —Å–∞–º—ã–º –¥–æ—Ä–æ–≥–∏–º –∏ —Å–∞–º—ã–º –¥–µ—à–µ–≤—ã–º –∑–∞–∫–∞–∑–æ–º –∏–∑ –°–®–ê.

In [14]:
tasks+=1
pd.read_sql(
    '''
    SELECT ((SELECT SUM(OrderDetails.Quantity*Products.Price) AS COST
    FROM Customers
    LEFT JOIN Orders
    ON Orders.CustomerID = Customers.CustomerID
    LEFT JOIN OrderDetails
    ON OrderDetails.OrderID = Orders.OrderID
    LEFT JOIN Products
    ON Products.ProductID = OrderDetails.ProductID
    WHERE Country = 'USA'
    GROUP BY OrderDetails.OrderID
    ORDER BY COST DESC LIMIT(1)) -
    (SELECT SUM(OrderDetails.Quantity*Products.Price) AS COST
    FROM Customers
    LEFT JOIN Orders
    ON Orders.CustomerID = Customers.CustomerID
    LEFT JOIN OrderDetails
    ON OrderDetails.OrderID = Orders.OrderID
    LEFT JOIN Products
    ON Products.ProductID = OrderDetails.ProductID
    WHERE Country = 'USA'
    GROUP BY OrderDetails.OrderID
    ORDER BY COST ASC LIMIT 1,1)) AS Difference
    ''',
    con,
)

   Difference
0     7638.45

9. –í—ã–≤–µ–¥–∏—Ç–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –∑–∞–∫–∞–∑–æ–≤ —É –∫–∞–∂–¥–æ–≥–æ –∏—Ö —Ç—Ä–µ—Ö —Å–∞–º—ã—Ö –º–æ–ª–æ–¥—ã—Ö —Å–æ—Ç—Ä—É–¥–Ω–∏–∫–æ–≤, –∞ —Ç–∞–∫–∂–µ –∏–º—è –∏ —Ñ–∞–º–∏–ª–∏—é –≤–æ –≤—Ç–æ—Ä–æ–π –∫–æ–ª–æ–Ω–∫–µ.

In [15]:
tasks+=1
pd.read_sql(
    '''
    SELECT Count(Orders.EmployeeID) AS Quantity, (FirstName || " " || LastName) AS Employee
    FROM Employees
    LEFT JOIN Orders
    ON Orders.EmployeeID = Employees.EmployeeID
    WHERE FirstName = 'Anne' or FirstName = 'Nancy' or FirstName = 'Janet'
    GROUP BY Orders.EmployeeID
    ORDER BY Quantity DESC
    ''',
    con,
)

   Quantity         Employee
0        31  Janet Leverling
1        29    Nancy Davolio
2         6   Anne Dodsworth

10. –°–∫–æ–ª—å–∫–æ –±–∞–Ω–æ–∫ –∫—Ä–∞–±–æ–≤–æ–≥–æ –º—è—Å–∞ –≤—Å–µ–≥–æ –±—ã–ª–æ –∑–∞–∫–∞–∑–∞–Ω–æ.

In [16]:
tasks+=1
pd.read_sql(
    '''
    SELECT SUM(Quantity) AS Quantity
    FROM OrderDetails
    LEFT JOIN Products
    ON Products.ProductID = OrderDetails.ProductID
    WHERE Products.ProductName = 'Boston Crab Meat'
    ''',
    con,
)

   Quantity
0       256

In [17]:
if tasks==10:
    print('–í—ã–ø–æ–ª–Ω–µ–Ω—ã –≤—Å–µ –∑–∞–¥–∞–Ω–∏—è üôÇ')
else:
    print('–í—ã–ø–æ–ª–Ω–µ–Ω—ã –Ω–µ –≤—Å–µ –∑–∞–¥–∞–Ω–∏—è! üôÄ')

–í—ã–ø–æ–ª–Ω–µ–Ω—ã –≤—Å–µ –∑–∞–¥–∞–Ω–∏—è üôÇ